

class city_country {

  List<String> city = ['القاهره','الجيزه','القليوبيه','الاسكندريه','البحيره','مطروح','الدقهليه','كفر الشيخ','الغربيه','المنوفيه','دمياط',
  'بورسعيد','الاسماعيليه','السويس','الشرقيه','بني سويف','المنيا','الفيوم','أسيوط' ,'سوهاج' ,'قنا','الأقصر','أسوان','الوادي الجديد','شمال سيناء','جنوب سيناء','البحر الأحمر'];

  Map<String,List<String>> country_map = {
    'القليوبيه' :['بنها','قليوب','القناطر الخيرية','الخانكة','كفر شكر','طوخ','شبين القناطر'],
    'الاسكندريه' :['برج العرب','المنتزة','العجمي','العامرية','برج العرب','العصافرة','بحري','كرموز','المعمورة','ميامي','سموحة'],
    'البحيره' : ['دمنهور','كفر الدوار','رشيد','إدكو','أبو المطامير','أبو حمص','الدلنجات','المحمودية','الرحمانية','إيتاي البارود','حوش عيسى','شبراخيت','كوم حمادة','بدر','وادي النطرون'],
    'مطروح' : [' مرسى مطروح','الحمام','العلمين','الضبعة','النجيلة','السلوم','سيوة'],
    'دمياط':['دمياط','فارسكور','كفر سعد','الزرقا',' كفر البطيخ'],
    'الدقهليه':['المنصورة','طلخا','ميت غمر','دكرنس','أجا','منية النصر','السنبلاوين','بني عبيد','المنزلة','مركز تمي الأمديد','الجمالية','شربين','المطرية','بلقاس','ميت سلسيل','محلة دمنة','نبروه'],
    'كفر الشيخ':['كفر الشيخ','دسوق','فوه','مطوبس','الرياض','قلين','بيلا','الحامول','سيدى سالم','بلطيم'],
    'الغربيه':['سمنود','قطور','السنطة','زفتى','طنطا','بسيون','المحله الكبرى','كفر الزيات'],
    'المنوفيه':['شبين الكوم','تلا','الشهداء','قويسنا','السادات','اشمون','الباجور','سرس الليان','منوف'],
    'الشرقيه':['الزقازيق','منيا القمح','بلبيس','مشتول السوق','أبو حماد','ههيا','أبو كبير','فاقوس','الإبراهيمية','ديرب نجم','كفر صقر','أولاد صقر','الحسينية','العاشر من رمضان'],
    'الاسماعيليه':['الإسماعيلية','التل الكبير','فايد','القنطرة شرق','القنطرة غرب','أبوصوير','القصاصين'],
    'شمال سيناء':['بئر العبد','نخل','الحسنة','العريش','الشيخ زويد','رفح'],
    'بني سويف':["الواسطى",'بني سويف','ناصر','إهناسيا','ببا','سمسطا','الفشن','بني سويف الجديدة'],
    'الفيوم':["الفيوم",'سنورس','إبشواي','اطسا','طامية','يوسف الصديق'],
    'المنيا':['مغاغة','بني مزار','مطاي','سمالوط','مدينة المنيا','أبو قرقاص','ملوي','دير مواس','العدوة'],
    'أسيوط':['ديروط','القوصية','أبنوب','منفلوط','أسيوط','الفتح','أبو تيج','الغنايم','ساحل سليم','البداري','صدفا'],
    'الوادي الجديد':['الخارجة','باريس','بلاط','الداخلة','الفرافرة'],
    'سوهاج':['سوهاج','أخميم','دارالسلام','ساقلتة','المراغة','طهطا','طما','جهينة','المنشاة','جرجا','البلينا'],
    'قنا':['أبو تشت','فرشوط','نجع حمادي','الوقف','دشنا','قنا','قفط','قوص','نقادة'],
    'الأقصر':['الأقصر','الأقصر الجديدة','طيبة الجديدة','الزينية','البياضية','القرنة','أرمنت','الطود','إسنا'],
    'أسوان':['أسوان','دراو','كوم أمبو','نصر النوبة','إدفو'],
    'البحر الأحمر':['الغردقة','سفاجا','مرسى علم','القصير','رأس غارب','شلاتين'],
    'جنوب سيناء':['أبو رديس','أبو زنيمة','نويبع','دهب','رأس سدر','شرم الشيخ','سانت كاترين','طور سيناء'],
    'السويس':['السويس','الأربعين','عتاقة','الجناين'],
    'القاهره':[],'الجيزه':[],'بورسعيد':['بور فؤاد','الزهور']
  };
}